app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Hiking"], ["created_at", "2021-08-26 16:01:29.743840"], ["updated_at", "2021-08-26 16:01:29.743840"]]
---
    def add_category_to_post
      @post = Post.find(params[:id])
      @category = Category.find(params[:category_id])

      @post.categories << @category

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Hiking"], ["created_at", "2021-08-26 16:01:29.743840"], ["updated_at", "2021-08-26 16:01:29.743840"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save