app/controllers/posts_controller.rb

INSERT INTO "posts" ("description", "title", "image_url", "user_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    if @post.save